Config/DataProcessors/ДобавлениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ДобавлениеСотрудников</Name>
			<Comment>Добавление сотрудников списком</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
					<Comment>Список сотрудников для добавления</Comment>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриёма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ДобавлениеСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокСотрудниковДатаПриёмаПриИзменении(Элемент)
	
    ТекущаяСтрока = Элементы.СписокСотрудников.ТекущиеДанные;
	
	Если ТекущаяСтрока.ДатаПриёма > ТекущаяДата() Тогда
		
		Сообщить("Дата приёма не может быть в будущем!");
		ТекущаяСтрока.ДатаПриёма = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьНовогосотрудника(ФИО, ДатаРождения, Подразделение, Должность, Оклад, ДатаПрийма)
	
	НовыйСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
	НовыйСотрудник.Наименование = ФИО;
	НовыйСотрудник.ДатаРождения = ДатаРождения;
	НовыйСотрудник.Подразделение = Подразделение;
	НовыйСотрудник.Должность = Должность;
	НовыйСотрудник.Оклад = Оклад;
	НовыйСотрудник.ДатаПриёма = ДатаПрийма;
	
	Попытка
		
		НовыйСотрудник.Записать();
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)
	
	Для Каждого Строка Из Объект.СписокСотрудников Цикл
		
		Если ПустаяСтрока(Строка.Сотрудник) Тогда
			
			Сообщить("ФИО сотрудника не может быть пустым!");
			Продолжить;
			
		КонецЕсли;
		
		Если СотрудникСуществуетНаСервере(Строка.Сотрудник) Тогда
			
			Ответ = Вопрос("Сотрудник """ + Строка.Сотрудник + """ уже существует! Добавить?", РежимДиалогаВопрос.ДаНет);
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				
				Продолжить;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДобавитьНовогосотрудника(Строка.Сотрудник, Строка.ДатаРождения, Строка.Подразделение, Строка.Должность, Строка.Оклад, Строка.ДатаПриёма) Тогда
			
			Сообщить("Сотрудник " + Строка.Сотрудник + " добавлен.");
			
		Иначе
			
			Сообщить("Не удалось добавить сотрудника " + Строка.Сотрудник + ". Попробуйте ещё раз.");
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция СотрудникСуществуетНаСервере(Сотрудник)	
	
	Возврат СотрудникСуществует(Сотрудник)
	
КонецФункции

&НаКлиенте
Процедура Очистить(Команда)
	Объект.СписокСотрудников.Очистить();
КонецПроцедуры
